Revit 2027 API
BasicLossFactor.LossFactor Property
 The loss factor.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double LossFactor { get; set; }
Public Property LossFactor As Double
	Get
	Set
public:
property double LossFactor {
	double get ();
	void set (double value);
}
member LossFactor : float with get, set
Property Value
Double
 The loss factor as a numerical value between 0.0 and 4.0
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The loss factor is not valid because it is not between 0.0 and 4.0.
See Also
Reference
BasicLossFactor Class
Autodesk.Revit.DB.Lighting Namespace